{"pageProps":{"post":{"title":"About Me","description":"Evan d'Entremont is an experienced technology leader with a talent for building and scaling global-scale software and teams.","image":null,"imagealt":"","htmlContent":"<p>Evan d'Entremont is an experienced technology leader with a talent for building and scaling global-scale software and teams. With practical experience in Python, PHP, and database management, Evan has a solid track record of creating reliable, high-performing web applications. He's also skilled at solving problems, improving processes, and fostering collaboration among diverse teams.</p>\n<p>Beyond tech, Evan's journey reflects a mix of curiosity and adaptability. Between early-stage startups and navigating corporate environments, he's always pushing boundaries and finding innovative solutions. When he's not deep in code, you'll find him experimenting with new projects or exploring ways to balance tech and life.</p>\n"},"allPosts":[{"slug":"10_seconds","title":"The 7-10 Second Resume Review - A Flawed Approach to Hiring"},{"slug":"404_jobnotfound","title":"Hiring rejections - the error messages we can't debug"},{"slug":"about_me","title":"About Me"},{"slug":"all_your_base","title":"From Hacking to SaaS - My early career as a freelancer."},{"slug":"bootstraps","title":"The Startup Success Formula - Luck, Wealth, and Rule-Breaking"},{"slug":"credentialism","title":"The Value of a Degree in Employer Markets"},{"slug":"cyber_tourdefrance","title":"AI - The Performance-Enhancing Drug for Software Developers"},{"slug":"government_control","title":"Should Canada Elect Senators?"},{"slug":"hack_the_planet","title":"Factoring Large Semiprimes."},{"slug":"hal_9000","title":"Could AI Govern?"},{"slug":"inevitability","title":"ChatGPT as an Adversarial Tool for Job Applications"},{"slug":"letstalk","title":"Let's talk about hollow words of wisdom"},{"slug":"pieces_of_flair","title":"Anything That is Measured, is Measured."},{"slug":"sportsball","title":"A Trip into Software Hell."},{"slug":"sprint_of_marx","title":"The history of all hitherto existing projects is the history of estimation struggles."},{"slug":"trial_by_fire","title":"Tell me about the last time you broke production."}]},"__N_SSG":true}