{"pageProps":{"post":{"title":"From Hacking to SaaS - My early career as a freelancer.","description":"This article explores a wild ride of freelancing and astroturfing, eventually leading to a more sustainable career.","image":"elliot.jpeg","imagealt":"Elliot from Mr. Robot.","htmlContent":"<p>Freelancing can be an unpredictable adventure, filled with highs, lows, and surprising twists. My journey is a testament to the unexpected turns that can shape a career. From an unconventional start involving hacking to dealing with the loss of a major client and eventually transitioning into the SaaS space, my path has been anything but ordinary. Here’s a look at how I navigated these challenges, including a particularly memorable project that combined creativity with a bit of mischief.</p>\n<h1>The Unconventional Start</h1>\n<p>My freelancing career began in an unconventional way. When a company was acquired, the new owners found themselves locked out of their website due to missing credentials. I used my technical skills to exploit an SQL injection vulnerability, gaining access to the site and saving the day. This initial success led to a long-term relationship with the company, which became a significant source of income, accounting for 80% of my business.</p>\n<p>The relationship with the CEO was solid, and everything seemed stable until tragedy struck. The CEO passed away unexpectedly, and the new leadership brought significant changes. Overnight, the majority of my income vanished as my work was redirected elsewhere. Desperate to maintain financial stability, I took the first opportunity available and joined an agency.</p>\n<h1>The Agency and Astroturfing</h1>\n<p>Joining the agency provided a new stream of projects, but not without its own set of challenges. One of the more unconventional and ethically complex projects involved astroturfing—creating a false appearance of grassroots support for various causes. The work was lucrative but often disingenuous, leading to a growing discomfort with the deceptive nature of some tasks.</p>\n<p>Amidst the various projects, one stood out for its creativity and humor. The project involved a local community effort to close a world-class garbage processing facility <em>in their \"backyard\"</em>. The residents, and by that I mean <em>one</em> resident with more money than friends, wanted to make his voice heard.</p>\n<p>I saw an opportunity to leverage my technical skills in a unique way.</p>\n<ol>\n<li>\n<p><strong>The Website:</strong> I set up a website to collect complaints from residents about the garbage dump. However, the twist was in how these complaints were delivered.</p>\n</li>\n<li>\n<p><strong>The Emails:</strong> To maximize impact, I programmed the website to send these complaints during city council meetings. The submissions were staggered and timed to coincide with the meeting schedule, causing every cell phone in the council room to go off at regular intervals.</p>\n</li>\n<li>\n<p><strong>The IT Department:</strong> The IT department of the city council eventually noticed the disruptive strategy and threatened to block us. However, all submissions were from legitimate users, albeit timed to create the most significant impact.</p>\n</li>\n</ol>\n<p>The constant interruptions drew significant attention to the residents’ complaints.</p>\n<h1>Transitioning to SaaS</h1>\n<p>I realized that I needed to pivot towards a more sustainable and fulfilling career path. I transitioned into the Software as a Service (SaaS) industry, leveraging my technical skills and unconventional problem-solving experiences.</p>\n<h2>Lessons Learned and Moving Forward</h2>\n<ol>\n<li>\n<p><strong>Adaptability and Creativity:</strong> The ability to adapt and think creatively was crucial in both the garbage dump project and my transition to SaaS. Embracing unconventional approaches can lead to unique solutions and opportunities.</p>\n</li>\n<li>\n<p><strong>Ethical Considerations:</strong> While creative strategies can be effective, it's important to maintain ethical standards. Reflecting on the impact of your work and ensuring it aligns with your values is essential.</p>\n</li>\n<li>\n<p><strong>Diversify and Adapt:</strong> The loss of a major client and the transition into new fields highlighted the importance of diversifying your client base and adapting to new opportunities.</p>\n</li>\n<li>\n<p><strong>Leverage Your Skills:</strong> My background in hacking and creative problem-solving proved valuable in the SaaS space, allowing me to bring a unique perspective to software development and solutions.</p>\n</li>\n</ol>\n<p>My freelancing journey—from hacking into a client’s website to dealing with the fallout of a major client’s death, engaging in astroturfing, and eventually transitioning to the SaaS industry—was been a whirlwind of experiences. Each phase taught me valuable lessons about adaptability, creativity, and ethical considerations.</p>\n<p>Freelancing is a path filled with opportunities for innovation and growth. By embracing creativity, staying true to your values, and being prepared for change, you can navigate the challenges and build a fulfilling career.</p>\n"},"allPosts":[{"slug":"10_seconds","title":"The 7-10 Second Resume Review - A Flawed Approach to Hiring"},{"slug":"404_jobnotfound","title":"Hiring rejections - the error messages we can't debug"},{"slug":"about_me","title":"About Me"},{"slug":"all_your_base","title":"From Hacking to SaaS - My early career as a freelancer."},{"slug":"bootstraps","title":"The Startup Success Formula - Luck, Wealth, and Rule-Breaking"},{"slug":"credentialism","title":"The Value of a Degree in Employer Markets"},{"slug":"cyber_tourdefrance","title":"AI - The Performance-Enhancing Drug for Software Developers"},{"slug":"government_control","title":"Should Canada Elect Senators?"},{"slug":"hack_the_planet","title":"Factoring Large Semiprimes."},{"slug":"hal_9000","title":"Could AI Govern?"},{"slug":"inevitability","title":"ChatGPT as an Adversarial Tool for Job Applications"},{"slug":"letstalk","title":"Let's talk about hollow words of wisdom"},{"slug":"pieces_of_flair","title":"Anything That is Measured, is Measured."},{"slug":"sportsball","title":"A Trip into Software Hell."},{"slug":"sprint_of_marx","title":"The history of all hitherto existing projects is the history of estimation struggles."},{"slug":"trial_by_fire","title":"Tell me about the last time you broke production."}]},"__N_SSG":true}